# MismatchNmbAssignedDistSysToCircuit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..MismatchNmbAssignedDistSysToCircuit Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Cannot assign or add [Element] to Circuit. There is no assigned distribution system for [Element].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MismatchNmbAssignedDistSysToCircuit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MismatchNmbAssignedDistSysToCircuit As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MismatchNmbAssignedDistSysToCircuit {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace